app/Controllers/LivroController.php

    public function salvar(){
        $Livro = $this->request->getPost();
        $this->LivroModel->save($Livro);
---
INSERT INTO `livro` (`registro`, `exemplar`, `titulo`, `status`) VALUES ('980', '5', 'Thiagas no país das martamilhas', 'Disponível — danificado')