app/Controllers/TomboController.php

    public function listar(){
        return $this->TomboModel->findAll();
---
SELECT *
FROM `tombo`